---
type: SolidGlass
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 11
tags: [revit-api, class]
---

# SolidGlass

`Autodesk.Revit.DB.Visual.SolidGlass` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | SolidglassBumpAmount | 2018.1 | `public static string SolidglassBumpAmount { get ; }` |
| Property | SolidglassBumpEnable | 2018.1 | `public static string SolidglassBumpEnable { get ; }` |
| Property | SolidglassBumpMap | 2018.1 | `public static string SolidglassBumpMap { get ; }` |
| Property | SolidglassColorByObject | 2018.1 | `public static string SolidglassColorByObject { get ; }` |
| Property | SolidglassGlossiness | 2018.1 | `public static string SolidglassGlossiness { get ; }` |
| Property | SolidglassReflectance | 2018.1 | `public static string SolidglassReflectance { get ; }` |
| Property | SolidglassRefractionIor | 2018.1 | `public static string SolidglassRefractionIor { get ; }` |
| Property | SolidglassTransmittance | 2018.1 | `public static string SolidglassTransmittance { get ; }` |
| Property | SolidglassTransmittanceCustomColor | 2018.1 | `public static string SolidglassTransmittanceCustomColor { get ; }` |